{
    "version": "https://jsonfeed.org/version/1",
    "title": "JoKiv",
    "description": "",
    "home_page_url": "https://jokiv.fi",
    "feed_url": "https://jokiv.fi/feed.json",
    "user_comment": "",
    "author": {
        "name": "JoKiv"
    },
    "items": [
        {
            "id": "https://jokiv.fi/peli-youtube-ja-twitch/",
            "url": "https://jokiv.fi/peli-youtube-ja-twitch/",
            "title": "Peli, YouTube ja Twitch",
            "summary": "Mainitsin aikaisemmin striimissä, että jos olisin twitchissä partneri, ennen kuin peli on valmis, voisin julkaista pelin ilmaiseksi. Tämä kun olisi myös katsojille se ilmainen vaihtoehto. Valitettavasti se Twitchin 75 katsojaa keskiarvolta on hieman korkea, joten myös striimissä mainitsin, että voisin harkita ilmaisjulkaisua, jos YouTubessa vaatimukset&hellip;",
            "content_html": "<p>Mainitsin aikaisemmin striimissä, että jos olisin twitchissä partneri, ennen kuin peli on valmis, voisin julkaista pelin ilmaiseksi. Tämä kun olisi myös katsojille se ilmainen vaihtoehto.</p>\n<p>Valitettavasti se Twitchin 75 katsojaa keskiarvolta on hieman korkea, joten myös striimissä mainitsin, että voisin harkita ilmaisjulkaisua, jos YouTubessa vaatimukset riittäisivät siellä vastaavaan ohjelmaan. </p>\n<p>Tässä sitten kävi striimin jäkeen mielessä, että jos twitch puolen asia tapahtuisi 2023 aikana, voisin harkita lähdekoodin julkaisua myöhempänä ajankohtana.</p>\n<p>Peli tekeminen on hieman ollut pysähdyksissä, kun <a href=\"https://jokiv.fi/kun-laitteet-hajoaa/\" target=\"_blank\" rel=\"noopener noreferrer\">asioita</a> <a href=\"https://jokiv.fi/laeppaerin-virtalaehde-kaipaa-vaihtoa/\" target=\"_blank\" rel=\"noopener noreferrer\">tapahtuu</a>, eikä se nosta innostusta, kun projektia tulisi säätää heikommalla laitteistolla. Kehitys on hidasta, mutta ottaa vauhtia, kun on paremmat laitteet käytössä.</p>",
            "author": {
                "name": "JoKiv"
            },
            "tags": [
                   "twitch",
                   "pelit",
                   "laitteet",
                   "YouTube"
            ],
            "date_published": "2023-03-31T12:03:01+03:00",
            "date_modified": "2023-03-31T12:03:01+03:00"
        },
        {
            "id": "https://jokiv.fi/juttelua-netissae/",
            "url": "https://jokiv.fi/juttelua-netissae/",
            "title": "Juttelua netissä",
            "summary": "Viimeaikoina on tullut juteltua jonkuverran jitsin kautta. Selaimella ja kännykällä on ihan hyvä ollu juteltua välistä vähän tuntemattomienki kanssa. Toki toiselle pitää linkki antaa jotain kautta, mutta satunnaiseen \"tuu meidän kans juttelemaan\" toi on toiminu ihan ok.",
            "content_html": "<p>Viimeaikoina on tullut juteltua jonkuverran <a href=\"https://meet.jit.si/\" target=\"_blank\" rel=\"noopener noreferrer\">jitsin</a> kautta. Selaimella ja kännykällä on ihan hyvä ollu juteltua välistä vähän tuntemattomienki kanssa. Toki toiselle pitää linkki antaa jotain kautta, mutta satunnaiseen \"tuu meidän kans juttelemaan\" toi on toiminu ihan ok.</p>",
            "author": {
                "name": "JoKiv"
            },
            "tags": [
                   "chat"
            ],
            "date_published": "2023-03-21T21:29:15+02:00",
            "date_modified": "2023-03-21T21:29:15+02:00"
        },
        {
            "id": "https://jokiv.fi/laeppaerin-virtalaehde-kaipaa-vaihtoa/",
            "url": "https://jokiv.fi/laeppaerin-virtalaehde-kaipaa-vaihtoa/",
            "title": "Läppärin virtalähde kaipaa vaihtoa",
            "summary": "Tuli huomattua, että läppärin virtalähteen liittimen pää oli hajonnut. Meni hetki kaivaa katkennut pää ulos läppärin liittimestä. Kunnes löydän uuden, netin sisällöntuotto voi olla enemmän katkonaista. Johto on kiinteästi kiinni virtalähteessä, joten koko virtalähde menee uusiksi. Mahdollisesti ensikuussa voin hommata jotain, jolla korvata tämän.",
            "content_html": "<p>Tuli huomattua, että läppärin virtalähteen liittimen pää oli hajonnut. Meni hetki kaivaa katkennut pää ulos läppärin liittimestä. Kunnes löydän uuden, netin sisällöntuotto voi olla enemmän katkonaista. Johto on kiinteästi kiinni virtalähteessä, joten koko virtalähde menee uusiksi. Mahdollisesti ensikuussa voin hommata jotain, jolla korvata tämän.</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://jokiv.fi/media/posts/43/laturi.jpg\" alt=\"\" width=\"800\" height=\"457\" sizes=\"100vw\" srcset=\"https://jokiv.fi/media/posts/43/responsive/laturi-xs.jpg 300w ,https://jokiv.fi/media/posts/43/responsive/laturi-sm.jpg 480w ,https://jokiv.fi/media/posts/43/responsive/laturi-md.jpg 768w ,https://jokiv.fi/media/posts/43/responsive/laturi-lg.jpg 1024w ,https://jokiv.fi/media/posts/43/responsive/laturi-xl.jpg 1360w ,https://jokiv.fi/media/posts/43/responsive/laturi-2xl.jpg 1600w\"></figure>",
            "author": {
                "name": "JoKiv"
            },
            "tags": [
                   "laitteet"
            ],
            "date_published": "2023-03-20T23:45:00+02:00",
            "date_modified": "2023-03-27T06:18:17+03:00"
        },
        {
            "id": "https://jokiv.fi/steam-deck-ja-striimaaminen/",
            "url": "https://jokiv.fi/steam-deck-ja-striimaaminen/",
            "title": "Steam Deck ja striimaaminen",
            "summary": "Varmaan kukaan ei yllättynyt, kun tein asian, johon on varmaan satoja opasvideoita YouTubessa. Tosin en seurannut mitään opasta, vaan asensin vain OBS Studion ja aloin käyttämään sitä. En kuitenkaan tässä vaiheessa ala säätämään isompia koristeluja striimin suhteen.",
            "content_html": "<p>Varmaan kukaan ei yllättynyt, kun tein asian, johon on varmaan satoja opasvideoita YouTubessa. Tosin en seurannut mitään opasta, vaan asensin vain <a href=\"https://obsproject.com/\" title=\"OBS Studio\" target=\"_blank\" rel=\"noopener noreferrer\">OBS Studion</a> ja aloin käyttämään sitä. En kuitenkaan tässä vaiheessa ala säätämään isompia koristeluja striimin suhteen.</p>",
            "author": {
                "name": "JoKiv"
            },
            "tags": [
                   "twitch",
                   "Steam Deck"
            ],
            "date_published": "2023-03-20T14:35:32+02:00",
            "date_modified": "2023-03-20T14:35:32+02:00"
        },
        {
            "id": "https://jokiv.fi/saeaetoeae-ja-saeaestoetoimia/",
            "url": "https://jokiv.fi/saeaetoeae-ja-saeaestoetoimia/",
            "title": "Säätöä ja säästötoimia",
            "summary": "Vaihdoin turvallisempaan tapaan pitää blogia ja samalla edullisempaan. Katsellaan miten tämä tulee auttamaan asioissa. Sivulla saattaa olla rikkinäisiä linkkejä, mutta korjaan niitä aina, kun löydän.",
            "content_html": "<p>Vaihdoin turvallisempaan tapaan pitää blogia ja samalla edullisempaan. Katsellaan miten tämä tulee auttamaan asioissa.</p>\n<p>Sivulla saattaa olla rikkinäisiä linkkejä, mutta korjaan niitä aina, kun löydän.</p>",
            "author": {
                "name": "JoKiv"
            },
            "tags": [
                   "blogi"
            ],
            "date_published": "2023-03-18T11:44:09+02:00",
            "date_modified": "2023-03-29T13:30:06+03:00"
        },
        {
            "id": "https://jokiv.fi/ajatuksia-taestae-vuodesta/",
            "url": "https://jokiv.fi/ajatuksia-taestae-vuodesta/",
            "title": "Ajatuksia tästä vuodesta",
            "summary": "Ihmiset ovat kyselleet tulevasta. Suunnitelmista ympäri vuoden. Assembly? Striimit? Pelimaraton? Totta puhuakseni, minulla ei ole niistä tällä hetkellä yhtään aatosta. Ainoa tän hetkinen suunnitelma on osallistua yhteen tulevaan asiaan (josta ei tule tämän enempää infoa julkisesti) ja sen perusteella joutuu melkein päättämään, jatketaanko edellisiäkään suunnitelmia,&hellip;",
            "content_html": "<p>Ihmiset ovat kyselleet tulevasta. Suunnitelmista ympäri vuoden. Assembly? Striimit? Pelimaraton?</p>\n<p>Totta puhuakseni, minulla ei ole niistä tällä hetkellä yhtään aatosta. Ainoa tän hetkinen suunnitelma on osallistua yhteen tulevaan asiaan (josta ei tule tämän enempää infoa julkisesti) ja sen perusteella joutuu melkein päättämään, jatketaanko edellisiäkään suunnitelmia, vai pistetäänkö ”pillit pussiin”.<br><br>Asia lähti tuosta koneen rikkoutumisesta tai oikeastaan jo joku kk sitä ennen, kun se alkoi oireilemaan. Se, että pystyin jatkaaman asioita eteenpäin, veti suunnileen kaikki säästöt. Yleensä vuoden alku mennään pienellä budjetilla, mutta tämä vuosi alkoi aika nollasta. Vielä ei olla miinuksella, mutta suunta on alaspäin, jos tää yksi tuleva asia ei auta.<br><br>Katsellaan miten menee. Todennäköisesti tästä päästään yli, mutta asioiden mennessä miinukselle, jatkoa on odotettavissa hitaammin. Ainakin toivon, että asiat jatkuvat. Edes myöhemmin.</p>",
            "author": {
                "name": "JoKiv"
            },
            "tags": [
                   "twitch",
                   "linux",
                   "discord",
                   "YouTube"
            ],
            "date_published": "2023-01-02T00:00:00+02:00",
            "date_modified": "2023-03-18T12:04:36+02:00"
        },
        {
            "id": "https://jokiv.fi/ylimaeaeraeisiae-sosiaalisia-medioita/",
            "url": "https://jokiv.fi/ylimaeaeraeisiae-sosiaalisia-medioita/",
            "title": "Ylimääräisiä sosiaalisia medioita",
            "summary": "Tämä ajatus lähti aikaisemmin, kun poistin Instagramin ja Snapchatin tunnukset. Tuli huomattua, ettei niile tarvetta ole. Tullut siihen päätökseen, että jos menee kuukausia ilman käyttöä, niin voisi laskea itselle turhaksi. Toki osa tulee olemaan käytössä esimerkiksi sukulaisten vuoksi. Ne jotka tietävät puhelinnumeron, löytävät minut muutenkin&hellip;",
            "content_html": "<p><!-- wp:paragraph --></p>\n<p>Tämä ajatus lähti aikaisemmin, kun poistin Instagramin ja Snapchatin tunnukset. Tuli huomattua, ettei niile tarvetta ole. Tullut siihen päätökseen, että jos menee kuukausia ilman käyttöä, niin voisi laskea itselle turhaksi. Toki osa tulee olemaan käytössä esimerkiksi sukulaisten vuoksi.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>Ne jotka tietävät puhelinnumeron, löytävät minut muutenkin whatsappissa, telegrammissa ja signalissa. Myös Threema löytyy, mutta sen muutaman euron hinta ei tunnu monia kiinnostavan.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>Mutta ei kannata ihmetellä, jos vain katoan jostain palvelusta, jos kukaan ei sitä kautta pidä yhteyttä.</p>\n<p><!-- /wp:paragraph --></p>",
            "author": {
                "name": "JoKiv"
            },
            "tags": [
                   "snapchat",
                   "instagram"
            ],
            "date_published": "2022-10-14T18:30:32+03:00",
            "date_modified": "2023-03-18T12:04:47+02:00"
        },
        {
            "id": "https://jokiv.fi/pelien-tekeminen-jatkuu/",
            "url": "https://jokiv.fi/pelien-tekeminen-jatkuu/",
            "title": "Pelien tekeminen jatkuu",
            "summary": "On silleen turhan kauan pidetty taukoa pelien tekemiseen puolella. Ajattelin tuossa aamutuimaan, että voisi aloittaa uuden projektin, koska vanhojen projektien kans on hieman ideoiden tasolla jumissa. Jotain uutta testiin. Toista pelimoottoria tai muuta pientä projektia. Saa uutta näkökulmaa asioihin. Vaikka Unreal Enginen esimerkkiprojektin sai kivuttomasti&hellip;",
            "content_html": "<p><!-- wp:paragraph --></p>\n<p>On silleen turhan kauan pidetty taukoa pelien tekemiseen puolella.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>Ajattelin tuossa aamutuimaan, että voisi aloittaa uuden projektin, koska vanhojen projektien kans on hieman ideoiden tasolla jumissa.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>Jotain uutta testiin. Toista pelimoottoria tai muuta pientä projektia. Saa uutta näkökulmaa asioihin.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>Vaikka Unreal Enginen esimerkkiprojektin sai kivuttomasti pyörimään Steam Deckillä, suunnitelmat ovat enemmän retrohenkisempään ja kevyempään.</p>\n<p><!-- /wp:paragraph --></p>",
            "author": {
                "name": "JoKiv"
            },
            "tags": [
                   "linux",
                   "YouTube",
                   "Steam Deck"
            ],
            "date_published": "2022-10-01T22:36:01+03:00",
            "date_modified": "2022-11-21T19:10:07+02:00"
        },
        {
            "id": "https://jokiv.fi/assembly-winter-2023/",
            "url": "https://jokiv.fi/assembly-winter-2023/",
            "title": "Assembly Winter 2023",
            "summary": "Minua on houkuteltu käymään ja kuvaamaan Assembly Winter tapahtumassa 2023. Tuo helmikuussa oleva tapahtuma on kuitenkin muiden säästämisien ja elämisen ohella hieman liian iso potti kerätä säästää lyhyessä ajassa. Laitoin uusien subien tavoitteen Twitchiin aiheesta, mutta en ole niin varma kerkeääkö se täyttyä. Sillä saisi&hellip;",
            "content_html": "<p><!-- wp:paragraph --></p>\n<p>Minua on houkuteltu käymään ja kuvaamaan Assembly Winter tapahtumassa 2023. Tuo helmikuussa oleva tapahtuma on kuitenkin muiden säästämisien ja elämisen ohella hieman liian iso potti kerätä säästää lyhyessä ajassa.</p>\n<p><!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>Laitoin uusien subien tavoitteen Twitchiin aiheesta, mutta en ole niin varma kerkeääkö se täyttyä. Sillä saisi katettua kuluja. No, katsella seuraavia, jos tähän ei pääse.</p>\n<p><!-- /wp:paragraph --></p>",
            "author": {
                "name": "JoKiv"
            },
            "tags": [
            ],
            "date_published": "2022-08-20T09:22:31+03:00",
            "date_modified": "2023-03-18T12:04:55+02:00"
        },
        {
            "id": "https://jokiv.fi/subathon/",
            "url": "https://jokiv.fi/subathon/",
            "title": "Subathon",
            "summary": "Parin striimin ajan on juteltu mahdollisesta subathonin järjestämisestä. Huumorilla kommentoin, että jos katsojia on tämän verran, niin tulee lyhyt striimi. Kyseessä on siis striimi, joka jatkuu niin kauan kuin subeja tulee. Etukäteen määritelty jatkuminen (esim 15 min lisää) jokaisesta subista. Elämässä on myös muut rajoitteet&hellip;",
            "content_html": "<p><!-- wp:paragraph --></p>\n<p>Parin striimin ajan on juteltu mahdollisesta subathonin järjestämisestä. Huumorilla kommentoin, että jos katsojia on tämän verran, niin tulee lyhyt striimi.</p>\n<p><!-- /wp:paragraph --> <!-- wp:paragraph --></p>\n<p>Kyseessä on siis striimi, joka jatkuu niin kauan kuin subeja tulee. Etukäteen määritelty jatkuminen (esim 15 min lisää) jokaisesta subista.</p>\n<p><!-- /wp:paragraph --> <!-- wp:paragraph --></p>\n<p>Elämässä on myös muut rajoitteet ja pidemmät striimit pakottaisivat taukoja väliin. Nukkuminen striimissä ei ole oikein mahdollista, muut nukkujat eivät halua striimin. Tosin aina voi jatkaa aikaisin, lepäämisen jälkeen. Jos ei sitte striimaa teltassa, yms.</p>\n<p><!-- /wp:paragraph --> <!-- wp:paragraph --></p>\n<p>Jää harkintaan.</p>\n<p><!-- /wp:paragraph --></p>",
            "author": {
                "name": "JoKiv"
            },
            "tags": [
                   "twitch"
            ],
            "date_published": "2022-07-29T21:00:40+03:00",
            "date_modified": "2023-03-18T12:37:30+02:00"
        }
    ]
}
