{
    "version": "https://jsonfeed.org/version/1",
    "title": "JoKiv",
    "description": "",
    "home_page_url": "https://jokiv.fi",
    "feed_url": "https://jokiv.fi/feed.json",
    "user_comment": "",
    "author": {
        "name": "JoKiv"
    },
    "items": [
        {
            "id": "https://jokiv.fi/amigan-retroa/",
            "url": "https://jokiv.fi/amigan-retroa/",
            "title": "Amigan retroa",
            "summary": "<p>Tuossa jonku aikaa aikaisemmin tuli tilattua <a href=\"https://en.wikipedia.org/wiki/Liberation:_Captive_2\" target=\"_blank\" rel=\"noopener noreferrer\">Liberation: Captive 2</a> Amigalle. En tarkemmin katsonut tilausta. Kohtuu edulliseen hintaan kuitenkin sai näin vanhaksi peliksi. Ohjekirja ja muut mukana.</p>\n",
            "content_html": "<p>Tuossa jonku aikaa aikaisemmin tuli tilattua <a href=\"https://en.wikipedia.org/wiki/Liberation:_Captive_2\" target=\"_blank\" rel=\"noopener noreferrer\">Liberation: Captive 2</a> Amigalle. En tarkemmin katsonut tilausta. Kohtuu edulliseen hintaan kuitenkin sai näin vanhaksi peliksi. Ohjekirja ja muut mukana.</p>\n\n<p>Tilaus saapui ja näytti hyväkuntoiselta. Ohjekirja mukana. Paketin avattua muistin, että \"ainiin korppuversioki on olemassa\". </p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://jokiv.fi/media/posts/83/korput.jpeg\" alt=\"Viisi pelin levykettä\" width=\"640\" height=\"360\" sizes=\"(max-width: 1920px) 100vw, 1920px\" srcset=\"https://jokiv.fi/media/posts/83/responsive/korput-xs.jpeg 640w ,https://jokiv.fi/media/posts/83/responsive/korput-sm.jpeg 768w ,https://jokiv.fi/media/posts/83/responsive/korput-md.jpeg 1024w ,https://jokiv.fi/media/posts/83/responsive/korput-lg.jpeg 1366w ,https://jokiv.fi/media/posts/83/responsive/korput-xl.jpeg 1600w ,https://jokiv.fi/media/posts/83/responsive/korput-2xl.jpeg 1920w\"></figure>\n<p>Ei tämä silti huono hankinta ollut. </p>\n<p>Joku aika myöhemmin mietin ajatusta, että aikanaan liikkui huhu, että tuota voi pelata levykkeiltä ja sen asentaminen oikealla laitteella kiintolevylle kestäisi \"ainaki 10 tuntia\". Koska oma Amiga 1200 on vielä vaiheessa saada valmiiksi (puuttuu muuntaja, tilailen paremman varallisuuden aikaan netistä) ajattelin testata asiaa emulaattorissa.</p>\n<p>Pääasiallinen asennus vei muutaman minuutin ja siellä oli valinnainen mahdollisuus generoida paremmat tekstuurit. Tämä oli myös kysymyksenä asennusvaiheessa, haluaako kopioida generoinnin tiedostot. Nämä olivat yksinään viidennellä levyllä.</p>\n<p>Generointi itsenään vei noin 4 tuntia ja 45 minuuttia laskea. Peliä pääsee pelaamaan alle vartissa, mutta jos haluaa generoida paremmat tekstuurit, se vie aikaa.</p>\n<p>Kun miettii amigan käyttäneen vanhoja kiintolevyjä, sekä mahdollinen käyttöjärjestelmän, jossa emulaattori pyöri, todennäköisesti cachettaneen kaiken kirjoituksen ram muistiin. Voisi olettaa, että vanhalle levyn käytöllä voi aika lähelle tuplaantua. Jos ei enemmänkin. Huhu tuntuu pitäneen paikkaansa, vaikka peliä voisi pelata huonommilla grafiikoilla ilman tuotakin. Toki peli toimi suoraan korpuiltakin.</p>\n<p>Emulaattorilla parhaalla amigalla (parhaat asetukset emulaattorista) generointiin meni 2-5 min. Vastaavan tasoiseen oikeaan Amigaan ei monellakaan ollut todennäköisesti mahdollisuutta tuona aikana, kun peli julkaistiin. Silti myös käytössä olisi ollu vanha kiintolevy.</p>\n<p>Vaikka asia olisi nopeutunut ja näppärimmät voineet käyttää RAM levyä. Mahdollisuudet tämän pelin pelaamiseen olivat <em>ilman generointia korpulta tai kiintolevyltä</em>, <em>generoida sen aikansa</em> (pistää vaikka yöksi laskemaan) tai <em>pelata CD32 versiota</em> pelistä.</p>\n<p>Valitettavasti minulla ei ole kirjoitushetkellä kuvakaappauksia tallessa, mutta eron huomaa. </p>\n<p>No tästä sitten jonku aikaa kului. Tuli tilattua lisää. </p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://jokiv.fi/media/posts/83/cd32.jpeg\" alt=\"CD32 versio pelistä\" width=\"640\" height=\"360\" sizes=\"(max-width: 1920px) 100vw, 1920px\" srcset=\"https://jokiv.fi/media/posts/83/responsive/cd32-xs.jpeg 640w ,https://jokiv.fi/media/posts/83/responsive/cd32-sm.jpeg 768w ,https://jokiv.fi/media/posts/83/responsive/cd32-md.jpeg 1024w ,https://jokiv.fi/media/posts/83/responsive/cd32-lg.jpeg 1366w ,https://jokiv.fi/media/posts/83/responsive/cd32-xl.jpeg 1600w ,https://jokiv.fi/media/posts/83/responsive/cd32-2xl.jpeg 1920w\"></figure>\n<p>Nyt taidan omistaa kaikki versiot pelistä. Pitäisiköhän harkita <a href=\"https://fi.wikipedia.org/wiki/Amiga_CD32\" target=\"_blank\" rel=\"noopener noreferrer\">Amiga CD32</a> hommaamista. <span class=\"s1\">😄 </span></p>\n<p><span class=\"s1\">Pelin tosin pitäisi toimia Amiga 1200, kunhan siihen hommaa tarvittavat osat. </span><span class=\"s1\">Vähän vaihtelevia raportteja lukenut, kuinka toimiva CD32:n pelaaminen Amiga 1200 loppujenlopuksi oli, kun itse Amiga CD32 ei ollut suuremmassa suosiossa myynnissä.</span></p>\n<p>Ehkä odottelen TheA1200 ja katselen mitä se osaa. Valitettavasti se näyttää viivästyvän. </p>",
            "author": {
                "name": "JoKiv"
            },
            "tags": [
                   "retro",
                   "pelit",
                   "amiga"
            ],
            "date_published": "2025-10-12T14:00:02+03:00",
            "date_modified": "2025-10-12T15:27:24+03:00"
        },
        {
            "id": "https://jokiv.fi/hitaita-paeivityksiae/",
            "url": "https://jokiv.fi/hitaita-paeivityksiae/",
            "title": "Hitaita päivityksiä",
            "summary": "<p>Tässä ollut elämän kanssa enemmän ja vähemmän kiireitä. Vaikka aikaa olisi ollut kirjoittaa päivityksiä, aina ei ole ollut aiheita, mistä voisi kirjoitella. Päivitetään nyt jotain.</p>\n",
            "content_html": "<p>Tässä ollut elämän kanssa enemmän ja vähemmän kiireitä. Vaikka aikaa olisi ollut kirjoittaa päivityksiä, aina ei ole ollut aiheita, mistä voisi kirjoitella. Päivitetään nyt jotain.</p>\n\n<p>Työt loppuivat aikaisemmin, kesän aikana. Määräaikainen sopimus.</p>\n<p>Päätin nyt aluksi keskittyväni enemmän striimien puolella retro-, konsoli- ja steam deckillä pelattaviin peleihin. Jossain välissä palaan myös irl- ja ulkoilustriimeihin. Saisi helpommin sisältöä useammalle päivälle striimeihin. Toki nykyisellä sisällöllä on helppo jaotella päiväkohtaiset aiheet, kuten olen discordissa listannut.</p>\n<p>Retron puolelle olen tilannut muutaman pelin, pari konetta ja muuta pientä. Sellaista, jotka omassa nuoruudessa ja aikana nuoruuden jälkeen ovat vaikuttaneet pelivalintoihin aikanaan. Niistä tulee enemmän discordissa ja striimissä.</p>\n<p>Aatoksissa on myös ollut muuttaa tätä blogia ja sivua jollain lailla. Vielä en ole mitään päättänyt, mutta katsellaan jos muutosta tulee jossain välissä. </p>",
            "author": {
                "name": "JoKiv"
            },
            "tags": [
                   "retro",
                   "pelit",
                   "laitteet"
            ],
            "date_published": "2025-10-05T16:04:41+03:00",
            "date_modified": "2025-10-06T12:52:13+03:00"
        },
        {
            "id": "https://jokiv.fi/hyvaeae-uutta-vuotta/",
            "url": "https://jokiv.fi/hyvaeae-uutta-vuotta/",
            "title": "Hyvää uutta vuotta",
            "summary": "Hyvää uutta vuotta kaikille! Uusi vuosi tuokoon mukanaan uusia mahdollisuuksia ja tavoitteita. Onnea, menestystä ja inspiraatiota tulevalle vuodelle.",
            "content_html": "<p>Hyvää uutta vuotta kaikille! Uusi vuosi tuokoon mukanaan uusia mahdollisuuksia ja tavoitteita. Onnea, menestystä ja inspiraatiota tulevalle vuodelle.</p>",
            "author": {
                "name": "JoKiv"
            },
            "tags": [
            ],
            "date_published": "2025-01-01T00:01:00+02:00",
            "date_modified": "2025-01-31T19:06:25+02:00"
        },
        {
            "id": "https://jokiv.fi/parempi-myoehaeaen-kuin-ei-milloinkaan/",
            "url": "https://jokiv.fi/parempi-myoehaeaen-kuin-ei-milloinkaan/",
            "title": "Parempi myöhään, kuin ei milloinkaan",
            "summary": "<p>Otsikon mukainen sanonta on aika tunnettu. Tässä kuitenki voi joidenki mielestä olla joidenkin mielestä \"mutta miksi..\", varsinkin kun kyseessä on <a href=\"https://en.wikipedia.org/wiki/Adobe_Flash\" target=\"_blank\" rel=\"noopener noreferrer\">flash</a>.</p>\n",
            "content_html": "<p>Otsikon mukainen sanonta on aika tunnettu. Tässä kuitenki voi joidenki mielestä olla joidenkin mielestä \"mutta miksi..\", varsinkin kun kyseessä on <a href=\"https://en.wikipedia.org/wiki/Adobe_Flash\" target=\"_blank\" rel=\"noopener noreferrer\">flash</a>.</p>\n\n<p>Todellakin aloin tutkimaan, miten flash toimiii. Aihe lähti siitä, kun katselin youtubesta videoita pelimoottoreista ja jonkinverran ennestään tuttu <a href=\"https://haxe.org/\" target=\"_blank\" rel=\"noopener noreferrer\">Haxe</a> tuli vastaan. Videossa myös mainittiin <a href=\"https://www.openfl.org/\" target=\"_blank\" rel=\"noopener noreferrer\">OpenFL</a>. </p>\n<p>Haxella on flash pelejä tehty, mitä olen ymmärtänyt. Tästä tuli mieleen muutama vanha flash peli, jotka kiinnostaa minua, mutta niissä on jonkuverran ongelmia nykykoneilla. Joko ne eivät halua pyöriä ilman muutamaa nettipuolen asiaa tai sitten ne on kirjoitettu, etteivät ne pyörisi. Mahdollisesti pelaajien seuranta, jossa serverit eivät ole toiminnassa tai vain ettei niitä useampi kopioi. Toki tiedän, että <a href=\"https://archive.org\" target=\"_blank\" rel=\"noopener noreferrer\">archive.org</a> sisältää useita kokoemia ja esimerkiksi <a href=\"https://flashpointarchive.org/\" target=\"_blank\" rel=\"noopener noreferrer\">Flashpoint Archive</a> (aiemmin nimellä BlueMaxima Flashpoint), sekä muutama muu.</p>\n<p>Kuitenkin haluan itse tutkia. Pelien ja ohjelmien toiminta on kiinnostava aihe itselle. Latasin <a href=\"https://github.com/jindrapetrik/jpexs-decompiler\" target=\"_blank\" rel=\"noopener noreferrer\">JPEXS Free Flash Decompiler</a> ja aloin tutkimaan swf tiedostojen sisältöä. Onneksi JPEXS osaa suoraan muokata koodia pelien sisällä. Osan sain toimimaan paremmin <a href=\"https://ruffle.rs/\" target=\"_blank\" rel=\"noopener noreferrer\">Rufflella</a>. Aikaisemmin peli joko jumi, vilkkui toimimatta tai ei toiminut ollenkaan. Yleisimmät ongelmat tulivat tutuiksi.</p>\n<p>Asensin vanhemman Windowsin virtuaalikoneesen ja vanhan Macromedia Flashin testiversiolla avasin JPEXS puretun pelin, jos flashillä uudelleen muuttaisi uudempaan formaattiin. Onnistuin pakkaamaan uudemmalle flash versiolle ja korjata koodista virheitä. Flash ohjelma osaa paremmin kertoa, jos koodissa on häikkää. Uudelleenpakkaamisen vie sen verran aikaa, etten ajattele sitä niin tarpeelliseksi. Suurimman osan voin vain korjata suoraan JPEXSllä. No ainaki sai hieman kokemusta aiheesta.</p>\n<p>Loppujenlopuksi sain pelin toimimaan, Ruffle ei valita ongelmista ja pyörittää tasaisesti. Joskus riittää, että koodista korjaa rivin tai kaksi koodia.</p>\n<p>Seuraavana ajatuksessa on mahdollisesti uudelleenkirjoittaa peli vaikka aloituksessa kommentoimallani Haxella. Mahdollisesti käyttäen <a href=\"https://haxeflixel.com/\" target=\"_blank\" rel=\"noopener noreferrer\">HaxeFlixel</a> ja <a href=\"https://www.openfl.org/\" target=\"_blank\" rel=\"noopener noreferrer\">OpenFL</a>. Tämä mahdollistaisi pelin pelaamisen ilman flashiä. Löysin myös keinoja muuntaa koodia kieleltä toiselle. Tästä kommentoin (ehkä) joskus toiste enemmän.</p>\n<p>Toki muitakin kieliä ja pelimoottoreita voisi käyttää. Onko kuitenkaan hyvä ajatus tehdä kymmenien tai satojen megojen kokoisen pelin alkuperäisestä puolen megan pelistä. Toki, jos remake tai remaster olisi mielessä. </p>\n<p>Katsotaan, mihin tämä (ehkä) johtaa. Nämä ovat näitä hitaasti eteneviä projekteja.</p>",
            "author": {
                "name": "JoKiv"
            },
            "tags": [
                   "virtuaalikone",
                   "retro",
                   "ohjelmointi",
                   "flash"
            ],
            "date_published": "2024-12-15T13:57:44+02:00",
            "date_modified": "2025-01-29T01:56:30+02:00"
        },
        {
            "id": "https://jokiv.fi/kuukausi-toeitae-takana/",
            "url": "https://jokiv.fi/kuukausi-toeitae-takana/",
            "title": "Kuukausi töitä takana",
            "summary": "<p>Nyt kun on ollu töissä kuukauden, huomaan miten pirteys ja jaksaminen ovat parantuneet.</p>\n",
            "content_html": "<p>Nyt kun on ollu töissä kuukauden, huomaan miten pirteys ja jaksaminen ovat parantuneet.</p>\n\n<p>Säännöllinen rytmi on tuonut lisää energiaa päiviin, ja herään useammin virkeänä. Vaikka en ole erityisesti kärsinyt uniongelmista, nukkumaan meno on nyt helpompaa kuin ennen. Työpäivät antavat juuri sopivasti haastetta ja rasitusta, joka auttaa rentoutumaan illalla. Säännöllisyys ja tasapaino vaikuttaa hyvinvointiin.</p>\n<p>Striimaaminen on taas käynnistynyt pitkän tauon jälkeen, ja nyt takana on muutama kerta. Pidempi tauko piti homman poissa hetken aikaa. Katsella tuleeko millä aikataululla ja useammin kuin pari kertaa kuukaudessa. Jatkon näkee sitten.</p>\n<p>Myös YouTube on jäänyt vähän vähemmälle, mutta katsellaan mitä sinne saisi aikaan.</p>",
            "author": {
                "name": "JoKiv"
            },
            "tags": [
            ],
            "date_published": "2024-09-30T08:57:12+03:00",
            "date_modified": "2024-09-30T08:57:12+03:00"
        },
        {
            "id": "https://jokiv.fi/vielae-steam-deck-dockista/",
            "url": "https://jokiv.fi/vielae-steam-deck-dockista/",
            "title": "Vielä Steam Deck Dockista",
            "summary": "<p>Kirjoitin <a>aikaisemmin</a> Steam Deck Docking Stationin hommaamisesta.</p>\n",
            "content_html": "<p>Kirjoitin <a>aikaisemmin</a> Steam Deck Docking Stationin hommaamisesta.</p>\n\n<p>Myin viime kuukausien aikana suurimman osan Steam-inventaarion tavaroista. Laskenut, että voin maksaa loput summasta.</p>\n<p>Laitoin tilauksen kyseisestä laitteesta. Tämä korvaa rikkoutuneen HDMI-adapterin ja helpottaa striimaamista.</p>\n<p>Toivotaan, että tulee ensiviikolla.</p>\n<p><em>Päivitys: Laite saapui 9.8.24</em></p>",
            "author": {
                "name": "JoKiv"
            },
            "tags": [
                   "steam deck",
                   "steam"
            ],
            "date_published": "2024-08-01T14:00:00+03:00",
            "date_modified": "2024-08-17T19:11:10+03:00"
        },
        {
            "id": "https://jokiv.fi/muutoksia-ko-fi-suhteen/",
            "url": "https://jokiv.fi/muutoksia-ko-fi-suhteen/",
            "title": "Muutoksia ko-fi suhteen",
            "summary": "<p><strong>Lyhyt versio</strong>: jotku maksutavat ovat väliaikaisesti (jos ei pysyvästi) pois ko-fi:n maksuista ja lahjoituksista.</p>\n",
            "content_html": "<p><strong>Lyhyt versio</strong>: jotku maksutavat ovat väliaikaisesti (jos ei pysyvästi) pois ko-fi:n maksuista ja lahjoituksista.</p>\n\n<p>Otin osan maksutavoista käytöstä, kun niiden kolmannen osapuolen käsittelijä (Stripe) on nähtävästi vaihtanut ehtoja, millaisia maksuja he välittävät tänä vuonna. <em>Sisällöntuottaminen ja striimaaminen</em> on yksiä aiheita, joista ne eivät nähtävästi liikaa pidä. Ko-fi tunnetaan juuri näistä parhaiten, vaikka se ei pelkästään niihin keskity.</p>\n<p>Tämä ei estä palvelun käyttämistä lahjoituksiin, mutta jotku maksamisen vaihtoehdot voivat olla kadoksissa.</p>",
            "author": {
                "name": "JoKiv"
            },
            "tags": [
                   "ko-fi"
            ],
            "date_published": "2024-06-04T10:49:46+03:00",
            "date_modified": "2024-06-04T10:52:22+03:00"
        },
        {
            "id": "https://jokiv.fi/guilded-tunnuksen-poistaminen/",
            "url": "https://jokiv.fi/guilded-tunnuksen-poistaminen/",
            "title": "Guilded tunnuksen poistaminen",
            "summary": "<p>Päätin poistaa Guilded tunnuksen. Siellä minulla ei ollut yhteyksiä keneenkään. Syyn voi lukea alla olevasta <a href=\"https://en.wikipedia.org/wiki/Guilded\" target=\"_blank\" rel=\"noopener noreferrer\">wikipedian lainauksesta</a>.</p>\n",
            "content_html": "<p>Päätin poistaa Guilded tunnuksen. Siellä minulla ei ollut yhteyksiä keneenkään. Syyn voi lukea alla olevasta <a href=\"https://en.wikipedia.org/wiki/Guilded\" target=\"_blank\" rel=\"noopener noreferrer\">wikipedian lainauksesta</a>.</p>\n\n<blockquote>\n<p>On May 31st, 2024, Guilded announced that all current and future accounts will be required to have a Roblox account linked before July 15th, 2024 in order to continue using their account with new accounts only having the option to sign up with Roblox.  -- Wikipedia</p>\n</blockquote>\n<p>Minulla oli näköjään myös vanha Roblox tunnus, jota he eivät olleet poistaneet käyttämättömyydestä huolimatta. Tein myös sille poistopyynnön.</p>",
            "author": {
                "name": "JoKiv"
            },
            "tags": [
                   "roblox",
                   "guilded"
            ],
            "date_published": "2024-06-03T13:16:00+03:00",
            "date_modified": "2024-06-04T13:17:24+03:00"
        },
        {
            "id": "https://jokiv.fi/toista-striimaus-softaa/",
            "url": "https://jokiv.fi/toista-striimaus-softaa/",
            "title": "Toista striimaus softaa",
            "summary": "<p>Tänään oli striimissä testissä <a href=\"https://prismlive.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Prism Live Studio</a> kännykällä. </p>\n",
            "content_html": "<p>Tänään oli striimissä testissä <a href=\"https://prismlive.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Prism Live Studio</a> kännykällä. </p>\n\n<p>Hyvinä puolina voi sanoa, että ohjelma toimi ongelmitta ja striimaus sujui hyvin. Myöskään mitään ylimääräisiä logoja yms. ei näkynyt lähetyskuvassa. Lähetyksen loputtua tuli pieni lopetusanimaatio, joka mainitsi softasta, mutta tämä ei ollut mitenkään ongelma.</p>\n<p>Hyvä lisä oli myös, että lähetyksen sai tallennettua puhelimelle. Iso yllätys oli, että vaikka lähetys oli 720p, tallenne oli 1080p. Tätä Twitchin ja YouTuben sovellukset eivät osaa tehdä. Jos haluat kopion, sinun tulee ladata lähetetty video, joka ei ole alkuperäisen tasolla. Jos lähetys on mutetettu joko virheellisesti tai aiheesta, et saa haettua alkuperäistä ääntä.</p>\n<p>Huonoina puolina voisi sanoa, että ainakin oletuksena (en tiedä voiko asiaa muuttaa) chatin tekstin tyyli ja väri oli valittu sellaisiksi, että jos aurinko paistoi sopivasta suunnasta, siitä ei saanut mitään selvää. Tähän voivat myös vaikuttaa puhelimen näyttö ja himmennysasetukset, joten en suoraan leimaa sovelluksen syyksi.</p>\n<p>Neutraalina puolena voi sanoa, että akun kulutus oli suurempi kuin Twitchin oman sovelluksen. Tosin tässä kohtaa annan anteeksi, kun kuitenkin tallennetaan videota paremmalla laadulla puhelimelle. YouTuben omaan sovellukseen verrattuna kulutus on suunnilleen sama, vaikka YouTuben laatu jäi todella huonoksi.</p>",
            "author": {
                "name": "JoKiv"
            },
            "tags": [
                   "video"
            ],
            "date_published": "2024-06-01T17:51:56+03:00",
            "date_modified": "2024-06-01T17:56:34+03:00"
        },
        {
            "id": "https://jokiv.fi/striimatessa-sattuu/",
            "url": "https://jokiv.fi/striimatessa-sattuu/",
            "title": "Striimatessa sattuu",
            "summary": "<p>Pientä päivitystä maanantain striimin aikana sattuneesta kolauksesta.</p>\n",
            "content_html": "<p>Pientä päivitystä maanantain striimin aikana sattuneesta kolauksesta.</p>\n\n<p>Kuten jotkut teistä ehkä muistavat, kolautin polven alapuolelle ulkoillessa. Vamma paranee hyvin. Uskon, että loppuviiikkoon mennessä ei tarvitse lisähoitoa.</p>",
            "author": {
                "name": "JoKiv"
            },
            "tags": [
                   "youtube"
            ],
            "date_published": "2024-05-22T18:15:17+03:00",
            "date_modified": "2024-05-22T18:16:20+03:00"
        }
    ]
}
