{
    "version": "https://jsonfeed.org/version/1",
    "title": "JoKiv",
    "description": "",
    "home_page_url": "https://jokiv.fi",
    "feed_url": "https://jokiv.fi/feed.json",
    "user_comment": "",
    "author": {
        "name": "JoKiv"
    },
    "items": [
        {
            "id": "https://jokiv.fi/parempi-myoehaeaen-kuin-ei-milloinkaan/",
            "url": "https://jokiv.fi/parempi-myoehaeaen-kuin-ei-milloinkaan/",
            "title": "Parempi myöhään, kuin ei milloinkaan",
            "summary": "<p>Otsikon mukainen sanonta on aika tunnettu. Tässä kuitenki voi joidenki mielestä olla joidenkin mielestä \"mutta miksi..\", varsinkin kun kyseessä on <a href=\"https://en.wikipedia.org/wiki/Adobe_Flash\" target=\"_blank\" rel=\"noopener noreferrer\">flash</a>.</p>\n",
            "content_html": "<p>Otsikon mukainen sanonta on aika tunnettu. Tässä kuitenki voi joidenki mielestä olla joidenkin mielestä \"mutta miksi..\", varsinkin kun kyseessä on <a href=\"https://en.wikipedia.org/wiki/Adobe_Flash\" target=\"_blank\" rel=\"noopener noreferrer\">flash</a>.</p>\n\n<p>Todellakin aloin tutkimaan, miten flash toimiii. Aihe lähti siitä, kun katselin youtubesta videoita pelimoottoreista ja jonkinverran ennestään tuttu <a href=\"https://haxe.org/\" target=\"_blank\" rel=\"noopener noreferrer\">Haxe</a> tuli vastaan. Videossa myös mainittiin <a href=\"https://www.openfl.org/\" target=\"_blank\" rel=\"noopener noreferrer\">OpenFL</a>. </p>\n<p>Haxella on flash pelejä tehty, mitä olen ymmärtänyt. Tästä tuli mieleen muutama vanha flash peli, jotka kiiinnostaa minua, mutta niissä on jonkuverran ongelmia nykykoneilla. Joko ne eivät halua pyöriä ilman muutamaa nettipuolen asiaa tai sitten ne on kirjoitettu, etteivät ne pyörisi. Mahdollisesti pelaajien seuranta, jossa serverit eivät ole toiminnassa tai vain ettei niitä useampi kopioi. Toki tiedän, että <a href=\"https://archive.org\" target=\"_blank\" rel=\"noopener noreferrer\">archive.org</a> sisältää useita kokoemia ja esimerkiksi <a href=\"https://flashpointarchive.org/\" target=\"_blank\" rel=\"noopener noreferrer\">Flashpoint Archive</a> (aiemmin nimellä BlueMaxima Flashpoint), sekä muutama muu.</p>\n<p>Kuitenkin haluaa itse tutkia. Pelien ja ohjelmien toiminta on kiinnostava aihe itselle. Latasin <a href=\"https://github.com/jindrapetrik/jpexs-decompiler\" target=\"_blank\" rel=\"noopener noreferrer\">JPEXS Free Flash Decompiler</a> ohjelman ja aloin tutkimaan swf tiedostojen sisältöä. Onneksi JPEXS osaa muokata koodia pelien sisällä. Osan pelistä sain toimimaan paremmin <a href=\"https://ruffle.rs/\" target=\"_blank\" rel=\"noopener noreferrer\">Rufflella</a>. Aikaisemmin peli joko jumi, vilkkui toimimatta tai ei toiminut ollenkaan. Yleisimmät ongelmat tulivat tutuiksi.</p>\n<p>Asensin vanhemman Windowsin virtuaalikoneesen ja vanhan Macromedia Flashin testiversiolla avasin JPEXS puretun pelin, jos flashillä uudelleen muuttaisi uudempaan formaattiin. Onnituin pakkaamaan uudemmalle flash versiolle ja korjata koodista virheitä. Flash ohjelma osaa paremmin kertoa, jos koodissa on häikkää. En ole varma onko uudelleenpakkaaminen niin tarpeellistä, varmaan voisin korjata samat virheet suoraan JPEXSllä. Kuitenkin saa hieman kokemusta aiheesta.</p>\n<p>Loppujenlopuksi sain pelin toimimaan, Ruffle ei valita ongelmista ja pyörittää tasaisesti. Tähänkin näköjään joskus riittää, että koodista korjaa rivin tai kaksi koodia.</p>\n<p>Seuraavana ajatuksessa on mahdollisesti uudelleenkirjoittaa peli vaikka aloituksessa kommentoimallani Haxella. Mahdollisesti käyttäen <a href=\"https://haxeflixel.com/\" target=\"_blank\" rel=\"noopener noreferrer\">HaxeFlixel</a> ja <a href=\"https://www.openfl.org/\" target=\"_blank\" rel=\"noopener noreferrer\">OpenFL</a>. Tämä mahdollistaisi pelin pelaamisen ilman flashiä. Löysin myös keinoja muuntaa koodia kieleltä toiselle. Tästä kommentoin ehkä joskus toiste enemmän.</p>\n<p>Toki muitakin kieliä ja pelimoottoreita voisi käyttää. Onko kuitenkaan hyvä ajatus tehdä kymmenien tai satojen megojen kokoisen pelin alkuperäisestä puolen megan pelistä. Toki, jos remake tai remaster olisi mielessä. </p>\n<p>Katsotaan, mihin tämä (ehkä) johtaa. Nämä ovat näitä hitaasti eteneviä projekteja.</p>",
            "author": {
                "name": "JoKiv"
            },
            "tags": [
                   "virtuaalikone",
                   "retro",
                   "ohjelmointi",
                   "flash"
            ],
            "date_published": "2024-12-15T13:57:44+02:00",
            "date_modified": "2024-12-15T14:01:06+02:00"
        },
        {
            "id": "https://jokiv.fi/kuukausi-toeitae-takana/",
            "url": "https://jokiv.fi/kuukausi-toeitae-takana/",
            "title": "Kuukausi töitä takana",
            "summary": "<p>Nyt kun on ollu töissä kuukauden, huomaan miten pirteys ja jaksaminen ovat parantuneet.</p>\n",
            "content_html": "<p>Nyt kun on ollu töissä kuukauden, huomaan miten pirteys ja jaksaminen ovat parantuneet.</p>\n\n<p>Säännöllinen rytmi on tuonut lisää energiaa päiviin, ja herään useammin virkeänä. Vaikka en ole erityisesti kärsinyt uniongelmista, nukkumaan meno on nyt helpompaa kuin ennen. Työpäivät antavat juuri sopivasti haastetta ja rasitusta, joka auttaa rentoutumaan illalla. Säännöllisyys ja tasapaino vaikuttaa hyvinvointiin.</p>\n<p>Striimaaminen on taas käynnistynyt pitkän tauon jälkeen, ja nyt takana on muutama kerta. Pidempi tauko piti homman poissa hetken aikaa. Katsella tuleeko millä aikataululla ja useammin kuin pari kertaa kuukaudessa. Jatkon näkee sitten.</p>\n<p>Myös YouTube on jäänyt vähän vähemmälle, mutta katsellaan mitä sinne saisi aikaan.</p>",
            "author": {
                "name": "JoKiv"
            },
            "tags": [
            ],
            "date_published": "2024-09-30T08:57:12+03:00",
            "date_modified": "2024-09-30T08:57:12+03:00"
        },
        {
            "id": "https://jokiv.fi/vielae-steam-deck-dockista/",
            "url": "https://jokiv.fi/vielae-steam-deck-dockista/",
            "title": "Vielä Steam Deck Dockista",
            "summary": "<p>Kirjoitin <a>aikaisemmin</a> Steam Deck Docking Stationin hommaamisesta.</p>\n",
            "content_html": "<p>Kirjoitin <a>aikaisemmin</a> Steam Deck Docking Stationin hommaamisesta.</p>\n\n<p>Myin viime kuukausien aikana suurimman osan Steam-inventaarion tavaroista. Laskenut, että voin maksaa loput summasta.</p>\n<p>Laitoin tilauksen kyseisestä laitteesta. Tämä korvaa rikkoutuneen HDMI-adapterin ja helpottaa striimaamista.</p>\n<p>Toivotaan, että tulee ensiviikolla.</p>\n<p><em>Päivitys: Laite saapui 9.8.24</em></p>",
            "author": {
                "name": "JoKiv"
            },
            "tags": [
                   "steam deck",
                   "steam"
            ],
            "date_published": "2024-08-01T14:00:00+03:00",
            "date_modified": "2024-08-17T19:11:10+03:00"
        },
        {
            "id": "https://jokiv.fi/muutoksia-ko-fi-suhteen/",
            "url": "https://jokiv.fi/muutoksia-ko-fi-suhteen/",
            "title": "Muutoksia ko-fi suhteen",
            "summary": "<p><strong>Lyhyt versio</strong>: jotku maksutavat ovat väliaikaisesti (jos ei pysyvästi) pois ko-fi:n maksuista ja lahjoituksista.</p>\n",
            "content_html": "<p><strong>Lyhyt versio</strong>: jotku maksutavat ovat väliaikaisesti (jos ei pysyvästi) pois ko-fi:n maksuista ja lahjoituksista.</p>\n\n<p>Otin osan maksutavoista käytöstä, kun niiden kolmannen osapuolen käsittelijä (Stripe) on nähtävästi vaihtanut ehtoja, millaisia maksuja he välittävät tänä vuonna. <em>Sisällöntuottaminen ja striimaaminen</em> on yksiä aiheita, joista ne eivät nähtävästi liikaa pidä. Ko-fi tunnetaan juuri näistä parhaiten, vaikka se ei pelkästään niihin keskity.</p>\n<p>Tämä ei estä palvelun käyttämistä lahjoituksiin, mutta jotku maksamisen vaihtoehdot voivat olla kadoksissa.</p>",
            "author": {
                "name": "JoKiv"
            },
            "tags": [
                   "ko-fi"
            ],
            "date_published": "2024-06-04T10:49:46+03:00",
            "date_modified": "2024-06-04T10:52:22+03:00"
        },
        {
            "id": "https://jokiv.fi/guilded-tunnuksen-poistaminen/",
            "url": "https://jokiv.fi/guilded-tunnuksen-poistaminen/",
            "title": "Guilded tunnuksen poistaminen",
            "summary": "<p>Päätin poistaa Guilded tunnuksen. Siellä minulla ei ollut yhteyksiä keneenkään. Syyn voi lukea alla olevasta <a href=\"https://en.wikipedia.org/wiki/Guilded\" target=\"_blank\" rel=\"noopener noreferrer\">wikipedian lainauksesta</a>.</p>\n",
            "content_html": "<p>Päätin poistaa Guilded tunnuksen. Siellä minulla ei ollut yhteyksiä keneenkään. Syyn voi lukea alla olevasta <a href=\"https://en.wikipedia.org/wiki/Guilded\" target=\"_blank\" rel=\"noopener noreferrer\">wikipedian lainauksesta</a>.</p>\n\n<blockquote>\n<p>On May 31st, 2024, Guilded announced that all current and future accounts will be required to have a Roblox account linked before July 15th, 2024 in order to continue using their account with new accounts only having the option to sign up with Roblox.  -- Wikipedia</p>\n</blockquote>\n<p>Minulla oli näköjään myös vanha Roblox tunnus, jota he eivät olleet poistaneet käyttämättömyydestä huolimatta. Tein myös sille poistopyynnön.</p>",
            "author": {
                "name": "JoKiv"
            },
            "tags": [
                   "roblox",
                   "guilded"
            ],
            "date_published": "2024-06-03T13:16:00+03:00",
            "date_modified": "2024-06-04T13:17:24+03:00"
        },
        {
            "id": "https://jokiv.fi/toista-striimaus-softaa/",
            "url": "https://jokiv.fi/toista-striimaus-softaa/",
            "title": "Toista striimaus softaa",
            "summary": "<p>Tänään oli striimissä testissä <a href=\"https://prismlive.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Prism Live Studio</a> kännykällä. </p>\n",
            "content_html": "<p>Tänään oli striimissä testissä <a href=\"https://prismlive.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Prism Live Studio</a> kännykällä. </p>\n\n<p>Hyvinä puolina voi sanoa, että ohjelma toimi ongelmitta ja striimaus sujui hyvin. Myöskään mitään ylimääräisiä logoja yms. ei näkynyt lähetyskuvassa. Lähetyksen loputtua tuli pieni lopetusanimaatio, joka mainitsi softasta, mutta tämä ei ollut mitenkään ongelma.</p>\n<p>Hyvä lisä oli myös, että lähetyksen sai tallennettua puhelimelle. Iso yllätys oli, että vaikka lähetys oli 720p, tallenne oli 1080p. Tätä Twitchin ja YouTuben sovellukset eivät osaa tehdä. Jos haluat kopion, sinun tulee ladata lähetetty video, joka ei ole alkuperäisen tasolla. Jos lähetys on mutetettu joko virheellisesti tai aiheesta, et saa haettua alkuperäistä ääntä.</p>\n<p>Huonoina puolina voisi sanoa, että ainakin oletuksena (en tiedä voiko asiaa muuttaa) chatin tekstin tyyli ja väri oli valittu sellaisiksi, että jos aurinko paistoi sopivasta suunnasta, siitä ei saanut mitään selvää. Tähän voivat myös vaikuttaa puhelimen näyttö ja himmennysasetukset, joten en suoraan leimaa sovelluksen syyksi.</p>\n<p>Neutraalina puolena voi sanoa, että akun kulutus oli suurempi kuin Twitchin oman sovelluksen. Tosin tässä kohtaa annan anteeksi, kun kuitenkin tallennetaan videota paremmalla laadulla puhelimelle. YouTuben omaan sovellukseen verrattuna kulutus on suunnilleen sama, vaikka YouTuben laatu jäi todella huonoksi.</p>",
            "author": {
                "name": "JoKiv"
            },
            "tags": [
                   "video"
            ],
            "date_published": "2024-06-01T17:51:56+03:00",
            "date_modified": "2024-06-01T17:56:34+03:00"
        },
        {
            "id": "https://jokiv.fi/striimatessa-sattuu/",
            "url": "https://jokiv.fi/striimatessa-sattuu/",
            "title": "Striimatessa sattuu",
            "summary": "<p>Pientä päivitystä maanantain striimin aikana sattuneesta kolauksesta.</p>\n",
            "content_html": "<p>Pientä päivitystä maanantain striimin aikana sattuneesta kolauksesta.</p>\n\n<p>Kuten jotkut teistä ehkä muistavat, kolautin polven alapuolelle ulkoillessa. Vamma paranee hyvin. Uskon, että loppuviiikkoon mennessä ei tarvitse lisähoitoa.</p>",
            "author": {
                "name": "JoKiv"
            },
            "tags": [
                   "youtube"
            ],
            "date_published": "2024-05-22T18:15:17+03:00",
            "date_modified": "2024-05-22T18:16:20+03:00"
        },
        {
            "id": "https://jokiv.fi/pieniae-ja-pidempiae-taukoja/",
            "url": "https://jokiv.fi/pieniae-ja-pidempiae-taukoja/",
            "title": "Pieniä ja pidempiä taukoja",
            "summary": "<p>Striimeissä on ollu pidempiä ja lyhyempiä taukoja. Inspiraatio hieman tipahti useamman vastoinkäymisen kanssa. En mene tarkemmin siihen, mitkä olivat häiritsevät tekijät. </p>\n",
            "content_html": "<p>Striimeissä on ollu pidempiä ja lyhyempiä taukoja. Inspiraatio hieman tipahti useamman vastoinkäymisen kanssa. En mene tarkemmin siihen, mitkä olivat häiritsevät tekijät. </p>\n\n<p>Striimin suhteen ajatuksena on ollut pyrkiä inspiroimaan itseäni tai sitten odotella kesää ja striimata enemmän ulkona. Katsoa nyt kumpi tulee ensin. </p>\n<p>Discordissa on tullut striimattua ajoittain. Ehkä se siitä lähtee Twitchin ja YouTuben puolelle jossain välissä. Tiedän, että useampi kyselee välistä, että missä striimit viipyvät. Vaikka tällä hetkellä ns. kevyeen striimaamiseen (ei suuria efektejä ja ilman kameraa) minulla on mahdollisuudet varmaan vuoksi eteenpäin, taukoja joutuu joskus vaan pitämään. </p>\n<p>Suunnitelmissa muuttaa hieman setuppia ulkona striimaamisen suhteen. Varallisuutta vaatisi ja sitä ei oikein satu olemaan. Katsellaan saako setuppiin muutosta kesällä tai loppuvuodesta. </p>\n<p>Nykyisen puhelimen tehot eivät sovi striimaamiseen. Edullisuuteen vaikutti varallisuuden puute. Jotku saattavat muistaa, että minulla oli toinen puhelin, jolla striimasin enemmän. Sen puhelimen akku ei pidä virtaa striimaamiseen.</p>\n<p>Virtapankit ovat näyttäneet vanhuuden merkkejä jo pidemmän aikaa. Ovat olleet käytössä muuallakin, kuin striimaamisessa. Ostettu edellisen vuoden aikana, ennen ekaa assembly striimiä. Testailin silloin sitä ulkona striimaamista. Assemblyssä kävin 2018 ja 2019.</p>\n<p>Ei olla vanhainkodissa striimaamassa, joten ei voi vielä lopettaa 😄</p>",
            "author": {
                "name": "JoKiv"
            },
            "tags": [
                   "youtube",
                   "laitteet"
            ],
            "date_published": "2024-04-28T16:39:44+03:00",
            "date_modified": "2024-04-28T16:39:44+03:00"
        },
        {
            "id": "https://jokiv.fi/airtag-testiae/",
            "url": "https://jokiv.fi/airtag-testiae/",
            "title": "AirTag tutustumista",
            "summary": "<p>Hommasin Applen <a href=\"https://fi.wikipedia.org/wiki/AirTag\" title=\"AirTag Wikipedia\" target=\"_blank\" rel=\"noopener noreferrer\">AirTagin</a>. Ajatuksena tutustua, mitä tuolla keksisi tehdä.</p>\n",
            "content_html": "<p>Hommasin Applen <a href=\"https://fi.wikipedia.org/wiki/AirTag\" title=\"AirTag Wikipedia\" target=\"_blank\" rel=\"noopener noreferrer\">AirTagin</a>. Ajatuksena tutustua, mitä tuolla keksisi tehdä.</p>\n\n<p>Toki ajatuksena kävi lähettää se jonnekkin postissa ja seurata lähetystä. Youtubessa on näitä videoita enemmän kuin tarpeeksi. Viimestään silloin, kun jossain kauempana käyn, tulee laitettua tuo tavaroiden sekaan.</p>",
            "author": {
                "name": "JoKiv"
            },
            "tags": [
                   "youtube",
                   "airtag"
            ],
            "date_published": "2024-03-20T12:00:00+02:00",
            "date_modified": "2024-03-22T11:13:48+02:00"
        },
        {
            "id": "https://jokiv.fi/harkinnassa-steam-deck-docking-station/",
            "url": "https://jokiv.fi/harkinnassa-steam-deck-docking-station/",
            "title": "Harkinnassa Steam Deck Docking Station",
            "summary": "<p>Ajattelin säästää <a href=\"https://store.steampowered.com/steamdeck\" target=\"_blank\" rel=\"noopener noreferrer\">Steam Deckin</a> <a href=\"https://store.steampowered.com/steamdeckdock\" target=\"_blank\" rel=\"noopener noreferrer\">Docking Stationiin</a>. Nykyinen ratkaisu tuntuu pätkivän hieman ja nykyhinta tuolle dockille on edullisempi, kuin uusi nykyisen kamppeen ostaminen.</p>\n",
            "content_html": "<p>Ajattelin säästää <a href=\"https://store.steampowered.com/steamdeck\" target=\"_blank\" rel=\"noopener noreferrer\">Steam Deckin</a> <a href=\"https://store.steampowered.com/steamdeckdock\" target=\"_blank\" rel=\"noopener noreferrer\">Docking Stationiin</a>. Nykyinen ratkaisu tuntuu pätkivän hieman ja nykyhinta tuolle dockille on edullisempi, kuin uusi nykyisen kamppeen ostaminen.</p>\n\n<p>Kuitenki jos tuon dockin hommaa, täytyy miettiä noiden nykyisten ulkoisten ohjaimien kuntoa. Dock ku on hankalampi pitää pelatessa kädessä, sitä ei ole siihen suunniteltu. Vaihtoehtoja kuitenki löytyy, eikä tietääkseni liian heikossa kunnossa ole nuo vuosia sitten hommatut ohjaimet.</p>",
            "author": {
                "name": "JoKiv"
            },
            "tags": [
                   "steam deck"
            ],
            "date_published": "2024-03-14T15:00:00+02:00",
            "date_modified": "2024-03-14T15:40:18+02:00"
        }
    ]
}
